# -*- coding: utf-8 -*-

import random


fake_person_date = []

first_name = ['김', '이', '박', '최', '정', '강', '조', '윤', '장', '임', '오', '서', '신', '권', '황', '안', '송', '전', '홍', '유', '고', '문', '양', '손', '배', '조', '백', '허', '유', '남', '심', '노', '정', '하', '곽', '성', '차', '주', '우', '구', '신', '임', '전', '민', '유', '류', '나', '진', '지', '엄', '채', '원', '천', '방', '공', '강', '현', '함', '변', '염', '양', '여', '추', '노', '도', '소', '신', '석', '선', '설', '마', '길', '주', '연', '방', '위', '표']
middle_name = ['이준', '서준', '하준', '도윤', '은우', '시우', '지호', '예준', '유준', '수호', '선우', '로운', '이안', '주원', '민준', '준우', '건우', '연우', '도현', '우주', '윤우', '시윤', '우진', '서진', '도하', '이든', '지후', '서우', '지안', '이현', '준서', '지한', '현우', '은호', '태오', '다온', '지훈', '정우', '하온', '한결', '하진', '지우', '시온', '라온', '유찬', '하민', '도겸', '율', '도율', '진우', '로이', '단우', '재윤', '이한', '지오', '승우', '주안', '태윤', '시후', '시안', '민재', '시현', '우빈', '유안', '준', '하율', '수현', '지환', '재하', '윤재', '서호', '하람', '지민', '도경', '윤호', '로건', '재이', '시원', '서후', '주호', '도준', '지율', '윤', '현준', '선호', '은찬', '하랑', '지원', '시율', '하늘', '아인', '건', '태양', '태하', '유건', '도훈', '온유', '태율', '시완', '도원', '민호', '하성', '현', '민찬', '유담', '서율', '해준', '강민', '재원', '아준', '시환', '도영', '준희', '태민', '민우', '시훈', '정후', '승현', '규빈', '규민', '민건', '준호', '하루', '시호', '도건', '이담', '연준', '재민', '정원', '승민', '지온', '로하', '예찬', '재율', '가온', '리안', '인우', '태이', '태준', '강우', '유현', '우준', '유하', '도운', '서원', '도진', '은성', '이찬', '다원', '우현', '준수', '민규', '산', '세준', '준혁', '은율', '찬', '지완', '윤성', '건희', '승준', '선율', '재현', '건율', '정민', '민성', '건후', '서하', '하윤', '예성', '지운', '승빈', '유진', '지성', '로한', '동하', '민혁', '결', '현서', '서빈', '승호', '주한', '이도', '윤후', '리우', '지혁', '노아', '범준', '재희', '승윤', '이수', '건호', '준영', '성빈', '수혁', '승재', '태현', '리한', '해솔', '준후', '성준', '신우', '연호', '민결', '윤찬', '승원', '태호', '태경', '서안', '주영', '유민', '태인', '우찬', '정현', '재준', '동현', '동윤', '주환', '세현', '해인', '한율', '태건', '이서', '시하', '주완', '시준', '리호', '성현', '주혁', '한울', '원', '우재', '호준', '원우', '우영', '찬영', '현민', '윤건', '서한', '찬율', '도빈', '채민', '성윤', '은준', '한별', '민서', '강현', '강준', '하빈', '건하', '모건', '혜성', '한솔', '주하', '찬우', '찬희', '가람', '시헌', '도연', '원준', '해든', '성민', '이재', '은후', '현진', '예담', '단', '이건', '윤준', '태겸', '경민', '은수', '솔', '준성', '재훈', '서윤', '태훈', '진', '상윤', '해성', '겸', '은재', '효준', '우성', '현호', '여준', '재우', '태우', '로빈', '현수', '루이', '제이', '영준', '민기', '재영', '예건', '호연', '다겸', '강', '채운', '하담', '강윤', '도담', '승유', '승후', '리온', '수민', '유빈', '태온', '유호', '태영', '진서', '정윤', '정빈', '준이', '다니엘', '연후', '해온', '하겸', '요한', '민', '윤서', '로아', '승찬', '로윤', '다율', '동우', '훈', '이솔', '현빈', '담', '지용', '도헌', '윤수', '유겸', '혜준', '재호', '근우', '현성', '정훈', '준원', '호진', '세윤', '동준', '현승', '상우', '리오', '이환', '한서', '주현', '채우', '민율', '규현', '루다', '민수', '진호', '용준', '수안', '유성', '진혁', '동연', '온', '민석', '아론', '보겸', '서온', '의준', '수빈', '유한', '동건', '지웅', '시언', '우혁', '해담', '성훈', '민겸', '대한', '동욱', '희준', '한', '유신', '지윤', '재혁', '하운', '태연', '강빈', '재빈', '희찬', '민후', '지수', '동훈', '재아', '세진', '인호', '주헌', '태성', '승훈', '환', '이헌', '수오', '지욱', '규원', '영우', '은결', '대현', '리환', '태환', '성우', '다엘', '정안', '환희', '하엘', '희성', '준하', '승기', '서현', '혁', '태웅', '시유', '윤오', '은혁', '찬민', '호윤', '다민', '루안', '하임', '제하', '레오', '태원', '승연', '연재', '규진', '태희', '담호', '종현', '승환', '준석', '한준', '든', '이겸', '상현', '우솔', '우리', '도균', '휘', '기범', '예온', '형준', '다호', '주형', '채호', '세온', '경준', '태빈', '세민', '민승', '선재', '은유', '호영', '이레', '세훈', '선', '도한', '로원', '주찬', '은오', '이삭', '서훈', '도', '도은', '우림', '유승', '성원', '시진', '준범', '찬빈', '선후', '호', '루하', '도언', '준휘', '안', '시영', '태유', '신', '주언', '도아', '테오', '시운', '민국', '석현', '지유', '다빈', '진후', '영민', '태서', '한겸', '정호', '진영', '도형']
phone_number_list = [0,1,2,3,4,5,6,7,8,9]

def random_user_name():
    first = random.choice(first_name)
    second = random.choice(middle_name)

    return first + second

def random_user_date():
    random_year = random.randint(1900, 2022)
    random_month = random.randint(1, 12)

    if random_month in [1, 3, 5, 7, 8, 10, 12]:
        random_day = random.randint(1, 31)
    elif random_month == 2:
        random_day = random.randint(1, 28)
    else:
        random_day = random.randint(1, 30)

    if random_month <= 9:
        random_month = "0" + str(random_month)
    if random_day <= 9:
        random_day = "0" + str(random_day)

    return str(random_year) + str(random_month) + str(random_day)

def random_phone_num():
    phone_number = ""

    # 핸드폰 번호 생성
    for cnt in range(8):
        random_num = str(random.choice(phone_number_list))
        phone_number = phone_number + random_num

        if cnt == 3:
            phone_number = phone_number + "-"

    return "010-" + phone_number


def random_user_num():
    random_year = random.randint(0, 99)
    random_month = random.randint(1, 12)

    if random_month in [1, 3, 5, 7, 8, 10, 12]:
        random_day = random.randint(1, 31)
    elif random_month == 2:
        random_day = random.randint(1, 28)
    else:
        random_day = random.randint(1, 30)

    if random_month <= 9:
        random_month = "0" + str(random_month)
    if random_day <= 9:
        random_day = "0" + str(random_day)
    if random_year <= 9:
        random_year = "0"+ str(random_year)

    first_personal_num = str(random_year) + str(random_month) + str(random_day)

    #1234567
    if int(random_year) > 30:
        sex = random.randint(1,2)
        random_num = random.randint(100000,999999)
    else:
        sex = random.randint(3,4)
        random_num = random.randint(100000, 999999)
    second_personal_num = str(sex) + str(random_num)

    return first_personal_num + "-" + second_personal_num



for _ in range(30):
    data = {}
    # 이름 생성
    data["이름"] = random_user_name()

    # 핸드폰 번호 생성
    data["전화번호"] = random_phone_num()

    #생년월일
    data["생년월일"] = random_user_date()

    #주민번호
    data["주민번호"] = random_user_num()

    fake_person_date.append(data)


import pandas as pd


df = pd.DataFrame(fake_person_date)
df.set_index('이름', inplace=True)   #name 열을 인덱스로 지정

df.to_excel("./exel_file.xlsx")



